lsh0223/stm32websystem/stm32Project/USER/main.c
        if (g_app.used_seconds > 0) UI_ShowServerMsg("已恢复上机状态");
        else UI_ShowServerMsg("刷卡成功，开始计费");
        g_server_msg_secs = 3;
    }

    if (esp8266_remote_card_err_flag) {
        esp8266_remote_card_err_flag = 0;
        g_wait_card_auth             = 0;
        if (esp8266_card_err_msg[0] != 0) UI_ShowServerMsg(esp8266_card_err_msg);
        else UI_ShowServerMsg("刷卡失败");
        g_server_msg_secs = 5;
        g_app.has_user = 0;
    }

    if (g_wait_card_auth) {
        if (GetSysMs() - g_card_auth_tick >= 5000) {
            g_wait_card_auth = 0;
            UI_ShowServerMsg("验证超时，请重刷");
            g_server_msg_secs = 3;
        }
    }

    if (g_server_msg_secs > 0) {
        g_server_msg_secs--;
        if (g_server_msg_secs == 0) UI_ClearServerMsg();
    }

    if ((g_app.state == STATE_INUSE) && (g_screen == SCREEN_INUSE)) {
        g_app.used_seconds++;
        UI_UpdateRuntimeAndFee();   
    }

    human         = Seat_Radar_Get();
    smoke_adc     = Seat_Smoke_GetRaw();
    smoke_percent = Smoke_AdcToPercent(smoke_adc);

    // ★★★ 占座报警修改：增加维护模式判断 ★★★
    if ((g_screen == SCREEN_WELCOME) && (g_app.state == STATE_IDLE) && (g_app.maint_mode == 0))
    {
        if (human) {
            if (g_idle_human_seconds < 0xFFFFFFFF) g_idle_human_seconds++;
					//测试先设置12秒占座
            if ((g_idle_human_seconds >= 12) && (g_idle_occupy_alarm == 0)) {
                g_idle_occupy_alarm = 1;
                if (ESP8266_GetState() == WIFI_STATE_CONNECTED)
                    ESP8266_MQTT_Publish("netbar/seat001/alert", "occupy_over_120s", 0, 0);
            }
        } else {
            g_idle_human_seconds = 0;
            g_idle_occupy_alarm  = 0;
        }
    } else {
        g_idle_human_seconds = 0;
        g_idle_occupy_alarm  = 0;
    }

    if (g_app.state == STATE_INUSE) {
        if (human) g_inuse_nohuman_seconds = 0;
        else {
            if (g_inuse_nohuman_seconds < 0xFFFFFFFF) g_inuse_nohuman_seconds++;
            if (g_inuse_nohuman_seconds >= 15 * 60) {
                if (ESP8266_GetState() == WIFI_STATE_CONNECTED)
                    ESP8266_MQTT_Publish("netbar/seat001/alert", "auto_checkout_nohuman_15min", 0, 0);
                App_EndSession();
                Netbar_Publish_SeatState();
                g_inuse_nohuman_seconds = 0;
            }
        }
    } else {
        g_inuse_nohuman_seconds = 0;
    }

    if (g_screen == SCREEN_WELCOME) UI_UpdateEnvWelcome(human, smoke_percent);
    else UI_UpdateEnvInuse(human, smoke_percent);

    UI_UpdateWifiIcon();
    ESP8266_Task_1s();
}

static void App_InitContext(void)
{
    g_app.state        = STATE_IDLE;
    g_app.has_user     = 0;
    memset(g_app.uid, 0, 4);
    strcpy((char *)g_app.user_name, "--");
    g_app.balance      = 0;        
    g_app.used_seconds = 0;
    g_app.pc_on        = 0;
    g_app.light_on     = 0;
    g_app.maint_mode   = 0;        

    Seat_PC_Set(0);
    Seat_Light_Set(0);
    Seat_Buzzer_Set(0);

    g_idle_human_seconds    = 0;
    g_idle_occupy_alarm     = 0;
    g_inuse_nohuman_seconds = 0;
    g_wait_card_auth        = 0;
    g_server_msg_secs       = 0;
}

static void App_SoftReset(void)
{
    printf("APP: soft reset start...\r\n");
    App_InitContext();
    g_screen        = SCREEN_WELCOME;
    g_confirm       = CONFIRM_NONE;
    LCD_Clear(WHITE);
    UI_DrawWelcomeStatic();
    ESP8266_Init();
    ESP8266_ConnectAP(WIFI_SSID, WIFI_PASS);
    delay_ms(1000);
    ESP8266_MQTT_Config();
    if (ESP8266_MQTT_Connect() == ESP8266_OK) printf("APP: MQTT reconnect ok\r\n");
    else printf("APP: MQTT reconnect FAIL\r\n");
    Netbar_Publish_SeatState();
    printf("APP: soft reset done.\r\n");
}

static void UI_DrawWelcomeStatic(void)
{
    LCD_Clear(WHITE);
    LCD_Fill(0, 0, lcddev.width - 1, 30, BLUE);
    POINT_COLOR = WHITE;
    BACK_COLOR  = BLUE;
    Show_Str(10, 5, lcddev.width - 90, 24, (u8 *)"智能无人网吧系统", 24, 0); 
    UI_UpdateWifiIcon();   
    POINT_COLOR = BLACK;
    BACK_COLOR  = WHITE;
    Show_Str(10, 40, lcddev.width - 20, 16, (u8 *)"欢迎使用", 16, 0);
    Show_Str(10, 60, lcddev.width - 20, 16, (u8 *)"费率: 1元/分钟(测试)", 16, 0);
    Show_Str(10, 90,  80, 16, (u8 *)"座位:", 16, 0);
    Show_Str(10, 110, 80, 16, (u8 *)"烟雾:", 16, 0);
    LCD_Fill(70, 90,  lcddev.width - 10, 106, WHITE);
    LCD_Fill(70, 110, lcddev.width - 10, 126, WHITE);
    LCD_Fill(10, 150, lcddev.width - 10, 190, GRAY);
    POINT_COLOR = BLUE;
    BACK_COLOR  = GRAY;
    if (g_app.maint_mode) Show_Str(20, 160, lcddev.width - 40, 16, (u8 *)"维护中，请勿上机", 16, 0);
    else Show_Str(20, 160, lcddev.width - 40, 16, (u8 *)"请刷卡上机", 16, 0);
    POINT_COLOR = BLACK;
    BACK_COLOR  = WHITE;
    Show_Str(10, 210, lcddev.width - 20, 16, (u8 *)"费率:1元/分钟", 16, 0);
    LCD_Fill(10, 230, lcddev.width - 10, 250, WHITE);
}

static void UI_DrawInuseStatic(void)
{
    LCD_Clear(WHITE);
    LCD_Fill(0, 0, lcddev.width - 1, 30, BLUE);
    POINT_COLOR = WHITE;
    BACK_COLOR  = BLUE;
    Show_Str(10, 5, lcddev.width - 90, 24, (u8 *)"上机中", 24, 0); 
    UI_UpdateWifiIcon();
    POINT_COLOR = BLACK;
    BACK_COLOR  = WHITE;
    Show_Str(10, 32, lcddev.width - 20, 16, (u8 *)"费率: 1元/分钟(测试)", 16, 0);
    Show_Str(10, 50,  70, 16, (u8 *)"状态:", 16, 0);
    Show_Str(10, 70,  70, 16, (u8 *)"用户:", 16, 0);
    Show_Str(10, 90,  70, 16, (u8 *)"卡号:", 16, 0);
    Show_Str(10, 110, 70, 16, (u8 *)"余额:", 16, 0);
    Show_Str(10, 130, 70, 16, (u8 *)"时长:", 16, 0);
    Show_Str(10, 150, 70, 16, (u8 *)"费用:", 16, 0);
    LCD_DrawRectangle(BTN_PC_X1, BTN_PC_Y1, BTN_PC_X2, BTN_PC_Y2);             
    LCD_DrawRectangle(BTN_LIGHT_X1, BTN_LIGHT_Y1, BTN_LIGHT_X2, BTN_LIGHT_Y2); 
    LCD_DrawRectangle(BTN_EXIT_X1, BTN_EXIT_Y1, BTN_EXIT_X2, BTN_EXIT_Y2);     
    Show_Str(10, 280, 80, 16, (u8 *)"座位:", 16, 0);
    Show_Str(10, 300, 80, 16, (u8 *)"烟雾:", 16, 0);
    Show_Str(10, 320, 120, 16, (u8 *)"费率:1元/分钟", 16, 0);
    LCD_Fill(70, 280, lcddev.width - 10, 336, WHITE);
}

static void UI_UpdateEnvWelcome(u8 human, u8 smoke_percent)
{
    char buf[16];
    u8  *level;
    LCD_Fill(70, 90, lcddev.width - 10, 106, WHITE);
    if (human) { POINT_COLOR = RED; Show_Str(70, 90, lcddev.width - 80, 16, (u8 *)"有人", 16, 0); }
    else { POINT_COLOR = BLACK; Show_Str(70, 90, lcddev.width - 80, 16, (u8 *)"无人", 16, 0); }
    LCD_Fill(70, 110, lcddev.width - 10, 126, WHITE);
    sprintf(buf, "%3d%%", smoke_percent);
    POINT_COLOR = BLACK;
    LCD_ShowString(70, 110, 80, 16, 16, (u8 *)buf);
    level = Smoke_LevelText(smoke_percent);
    Show_Str(150, 110, 100, 16, level, 16, 0);
    if ((smoke_percent >= 60) || (g_idle_occupy_alarm)) Seat_Buzzer_Set(1);
    else Seat_Buzzer_Set(0);
    POINT_COLOR = BLACK;
}

static void UI_UpdateEnvInuse(u8 human, u8 smoke_percent)
{
    char buf[16];
    u8  *level;
    LCD_Fill(70, 280, lcddev.width - 10, 296, WHITE);
    if (human) { POINT_COLOR = RED; Show_Str(70, 280, lcddev.width - 80, 16, (u8 *)"有人", 16, 0); }
    else { POINT_COLOR = BLACK; Show_Str(70, 280, lcddev.width - 80, 16, (u8 *)"无人", 16, 0); }
    LCD_Fill(70, 300, lcddev.width - 10, 316, WHITE);
    sprintf(buf, "%3d%%", smoke_percent);
    POINT_COLOR = BLACK;
    LCD_ShowString(70, 300, 80, 16, 16, (u8 *)buf);
    level = Smoke_LevelText(smoke_percent);
    Show_Str(150, 300, 100, 16, level, 16, 0);
    if (smoke_percent >= 60) Seat_Buzzer_Set(1);
    else Seat_Buzzer_Set(0);
    POINT_COLOR = BLACK;
}

static void UI_UpdateStateLine(void)
{
    u8 *text;
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 50, 310, 66, WHITE);
    if (g_app.state == STATE_IDLE) text = (u8 *)"待机";
    else text = (u8 *)"上机中";
    Show_Str(80, 50, 230, 16, text, 16, 0);
}

static void UI_UpdateUserLine(void)
{
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 70, 310, 86, WHITE);
    if (g_app.state == STATE_IDLE || g_app.has_user == 0) Show_Str(80, 70, 230, 16, (u8 *)"--", 16, 0);
    else Show_Str(80, 70, 230, 16, g_app.user_name, 16, 0);
}

static void UI_UpdateCardLine(void)
{
    char buf[24];
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 90, 310, 106, WHITE);
    if (g_app.has_user) {
        sprintf(buf, "%02X %02X %02X %02X", g_app.uid[0], g_app.uid[1], g_app.uid[2], g_app.uid[3]);
        LCD_ShowString(80, 90, 230, 16, 16, (u8 *)buf);
    } else Show_Str(80, 90, 230, 16, (u8 *)"--", 16, 0);
}

static void UI_UpdateBalanceLine(void)
{
    char buf[24];
    u32 yuan;
    u32 cent;
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 110, 310, 126, WHITE);
    yuan = g_app.balance / 100;
    cent = g_app.balance % 100;
    sprintf(buf, "%lu.%02lu 元", (unsigned long)yuan, (unsigned long)cent);
    Show_Str(80, 110, 230, 16, (u8 *)buf, 16, 0);
}

static void UI_UpdateRuntimeAndFee(void)
{
    u32 min;
    u32 sec;
    u32 fee;
    char buf[24];
    min = g_app.used_seconds / 60;
    sec = g_app.used_seconds % 60;
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 130, 310, 146, WHITE);
    sprintf(buf, "%02lu:%02lu", min, sec);
    Show_Str(80, 130, 230, 16, (u8 *)buf, 16, 0);
    fee = (g_app.used_seconds / 60) * PRICE_PER_MIN;
    LCD_Fill(80, 150, 310, 166, WHITE);
    sprintf(buf, "%4lu 元", fee);
    Show_Str(80, 150, 230, 16, (u8 *)buf, 16, 0);
}

// ★★★ 核心修复：防止断线时强行发数据导致串口拥堵 ★★★
static void Netbar_Publish_SeatState(void)
{
    char payload[96];
    u8  human;
    u16 smoke_adc;
    u8  smoke_percent;
    u8  iu;
    u32 used_seconds;
    u32 fee;

