lsh0223/stm32websystem/stm32Project/USER/main.c
    if (ESP8266_GetState() != WIFI_STATE_CONNECTED || g_mqtt_state != MQTT_STATE_CONNECTED) return;

    human        = Seat_Radar_Get();
    smoke_adc    = Seat_Smoke_GetRaw();
    smoke_percent= Smoke_AdcToPercent(smoke_adc);
    iu           = (g_app.state == STATE_INUSE) ? 1 : 0;
    used_seconds = g_app.used_seconds;
    fee          = (used_seconds / 60) * PRICE_PER_MIN;   

    sprintf(payload, "s=1;iu=%d;pc=%d;lt=%d;hm=%d;sm=%d;sec=%lu;fee=%lu", iu, g_app.pc_on, g_app.light_on, human, smoke_percent, used_seconds, fee);
    publish_seq++;
    ESP8266_MQTT_Publish("netbar/seat001/state", payload, 0, 0);
}

static void UI_UpdatePCButton(void)
{
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    if (g_app.pc_on) {
        LCD_Fill(BTN_PC_X1 + 1, BTN_PC_Y1 + 1, BTN_PC_X2 - 1, BTN_PC_Y2 - 1, GREEN);
        Show_Str(BTN_PC_X1 + 20, BTN_PC_Y1 + 12, 100, 16, (u8 *)"关电脑", 16, 0);
    } else {
        LCD_Fill(BTN_PC_X1 + 1, BTN_PC_Y1 + 1, BTN_PC_X2 - 1, BTN_PC_Y2 - 1, GRAY);
        Show_Str(BTN_PC_X1 + 20, BTN_PC_Y1 + 12, 100, 16, (u8 *)"开电脑", 16, 0);
    }
    LCD_DrawRectangle(BTN_PC_X1, BTN_PC_Y1, BTN_PC_X2, BTN_PC_Y2);
}

static void UI_UpdateLightButton(void)
{
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    if (g_app.light_on) {
        LCD_Fill(BTN_LIGHT_X1 + 1, BTN_LIGHT_Y1 + 1, BTN_LIGHT_X2 - 1, BTN_LIGHT_Y2 - 1, GREEN);
        Show_Str(BTN_LIGHT_X1 + 20, BTN_LIGHT_Y1 + 12, 100, 16, (u8 *)"关灯光", 16, 0);
    } else {
        LCD_Fill(BTN_LIGHT_X1 + 1, BTN_LIGHT_Y1 + 1, BTN_LIGHT_X2 - 1, BTN_LIGHT_Y2 - 1, GRAY);
        Show_Str(BTN_LIGHT_X1 + 20, BTN_LIGHT_Y1 + 12, 100, 16, (u8 *)"开灯光", 16, 0);
    }
    LCD_DrawRectangle(BTN_LIGHT_X1, BTN_LIGHT_Y1, BTN_LIGHT_X2, BTN_LIGHT_Y2);
    LCD_Fill(BTN_EXIT_X1 + 1, BTN_EXIT_Y1 + 1, BTN_EXIT_X2 - 1, BTN_EXIT_Y2 - 1, RED);
    POINT_COLOR = WHITE; BACK_COLOR  = RED;
    Show_Str(BTN_EXIT_X1 + 20, BTN_EXIT_Y1 + 12, 120, 16, (u8 *)"下机结算", 16, 0);
    LCD_DrawRectangle(BTN_EXIT_X1, BTN_EXIT_Y1, BTN_EXIT_X2, BTN_EXIT_Y2);
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
}

static void UI_UpdateWifiIcon(void)
{
    WifiState cur;
    u16 base_x;
    u16 base_y;
    cur = ESP8266_GetState();
    base_x = lcddev.width - 40; 
    base_y = 6;                 
    POINT_COLOR = WHITE; BACK_COLOR  = BLUE;
    LCD_Fill(lcddev.width - 70, 0, lcddev.width - 1, 30, BLUE);
    if (cur == WIFI_STATE_CONNECTED) {
        LCD_Fill(base_x,     base_y + 8,  base_x + 6, base_y + 14, WHITE); 
        LCD_Fill(base_x + 8, base_y + 4,  base_x +14, base_y + 14, WHITE); 
        LCD_Fill(base_x +16, base_y,      base_x +22, base_y + 14, WHITE); 
    } else if (cur == WIFI_STATE_CONNECTING) {
        LCD_Fill(base_x,     base_y + 8,  base_x + 6, base_y + 14, WHITE);
        LCD_Fill(base_x + 8, base_y + 4,  base_x +14, base_y + 14, WHITE);
        LCD_DrawRectangle(base_x +16, base_y, base_x +22, base_y + 14);
    } else if (cur == WIFI_STATE_DISCONNECTED) {
        LCD_Fill(base_x,     base_y + 8,  base_x + 6, base_y + 14, WHITE);
        LCD_DrawRectangle(base_x + 8, base_y + 4, base_x +14, base_y + 14);
        LCD_DrawRectangle(base_x +16, base_y,      base_x +22, base_y + 14);
    } else {
        POINT_COLOR = WHITE;
        LCD_DrawLine(base_x,     base_y,     base_x + 15, base_y + 15);
        LCD_DrawLine(base_x,     base_y +15, base_x + 15, base_y);
    }
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
}

static u8 Smoke_AdcToPercent(u16 adc)
{
    if (adc <= 500)   return 0;
    if (adc >= 3500)  return 100;
    return (u8)((adc - 500) * 100 / (3500 - 500));
}

static u8* Smoke_LevelText(u8 percent)
{
    if (percent < 30) return (u8 *)"良好";
    else if (percent < 60) return (u8 *)"中等";
    else if (percent < 80) return (u8 *)"较高";
    else return (u8 *)"危险";
}

static void UID_ToHex(const u8 *uid, char *out)
{
    sprintf(out, "%02X%02X%02X%02X", uid[0], uid[1], uid[2], uid[3]);
}

static void App_OnCard(u8 *uid)
{
    u8  i;
    char uid_hex[9];
    char payload[32];

    if (g_app.maint_mode) {
        UI_ShowServerMsg("座位维护中，暂不提供上机服务");
        g_server_msg_secs = 5;
        return;
    }

    if (g_app.state == STATE_INUSE) {
        UI_ShowServerMsg("已在上机中");
        g_server_msg_secs = 3;
        return;
    }

    for (i = 0; i < 4; i++) g_app.uid[i] = uid[i];
    g_app.has_user = 1;

    UID_ToHex(uid, uid_hex);
    sprintf(payload, "uid=%s", uid_hex);

    if (ESP8266_GetState() == WIFI_STATE_CONNECTED) {
        ESP8266_MQTT_Publish("netbar/seat001/card", payload, 0, 0);
        g_wait_card_auth = 1;
        g_card_auth_tick = GetSysMs();
        UI_ShowServerMsg("正在验证，请稍候...");
        g_server_msg_secs = 5;
    } else {
        UI_ShowServerMsg("网络未连接，无法验证");
        g_server_msg_secs = 5;
    }
}

static void App_EndSession(void)
{
    App_InitContext();   
    g_screen  = SCREEN_WELCOME;
    g_confirm = CONFIRM_NONE;
    UI_DrawWelcomeStatic();
    Netbar_Publish_SeatState();
}

static void UI_ShowConfirmDialog(confirm_type_t type)
{
    LCD_Fill(CONF_X1, CONF_Y1, CONF_X2, CONF_Y2, GRAY);
    LCD_DrawRectangle(CONF_X1, CONF_Y1, CONF_X2, CONF_Y2);
    POINT_COLOR = BLACK; BACK_COLOR  = GRAY;
    if (type == CONFIRM_PC_OFF) Show_Str(CONF_X1 + 20, CONF_Y1 + 20, 220, 16, (u8 *)"确认关机？", 16, 0);
    else if (type == CONFIRM_EXIT) Show_Str(CONF_X1 + 20, CONF_Y1 + 20, 220, 16, (u8 *)"确认下机结算？", 16, 0);
    LCD_Fill(CONF_BTN_OK_X1, CONF_BTN_OK_Y1, CONF_BTN_OK_X2, CONF_BTN_OK_Y2, GREEN);
    POINT_COLOR = WHITE; BACK_COLOR  = GREEN;
    Show_Str(CONF_BTN_OK_X1 + 8, CONF_BTN_OK_Y1 + 8, 80, 16, (u8 *)"确认", 16, 0);
    LCD_DrawRectangle(CONF_BTN_OK_X1, CONF_BTN_OK_Y1, CONF_BTN_OK_X2, CONF_BTN_OK_Y2);
    LCD_Fill(CONF_BTN_CANCEL_X1, CONF_BTN_CANCEL_Y1, CONF_BTN_CANCEL_X2, CONF_BTN_CANCEL_Y2, RED);
    POINT_COLOR = WHITE; BACK_COLOR  = RED;
    Show_Str(CONF_BTN_CANCEL_X1 + 8, CONF_BTN_CANCEL_Y1 + 8, 80, 16, (u8 *)"取消", 16, 0);
    LCD_DrawRectangle(CONF_BTN_CANCEL_X1, CONF_BTN_CANCEL_Y1, CONF_BTN_CANCEL_X2, CONF_BTN_CANCEL_Y2);
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
}

static void App_HandleTouch(void)
{
    u8  is_down;
    u16 x, y;

    if (tp_dev.scan(0)) {
        is_down = (tp_dev.sta & TP_PRES_DOWN) ? 1 : 0;
        x = tp_dev.x[0];
        y = tp_dev.y[0];
    } else {
        is_down = 0; x = 0; y = 0;
    }

