lsh0223/stm32websystem/stm32Project/USER/main.c
    if (is_down) {
        if (!g_touch_down) {
            g_touch_down = 1;
            if (g_screen == SCREEN_INUSE) {
                if ((x > BTN_PC_X1) && (x < BTN_PC_X2) && (y > BTN_PC_Y1) && (y < BTN_PC_Y2)) {
                    if (!g_app.pc_on) { g_app.pc_on = 1; Seat_PC_Set(1); UI_UpdatePCButton(); }
                    else { g_confirm = CONFIRM_PC_OFF; g_screen = SCREEN_CONFIRM; UI_ShowConfirmDialog(g_confirm); }
                } else if ((x > BTN_LIGHT_X1) && (x < BTN_LIGHT_X2) && (y > BTN_LIGHT_Y1) && (y < BTN_LIGHT_Y2)) {
                    g_app.light_on = g_app.light_on ? 0 : 1; Seat_Light_Set(g_app.light_on); UI_UpdateLightButton();
                } else if ((x > BTN_EXIT_X1) && (x < BTN_EXIT_X2) && (y > BTN_EXIT_Y1) && (y < BTN_EXIT_Y2)) {
                    if (g_app.state == STATE_INUSE) { g_confirm = CONFIRM_EXIT; g_screen = SCREEN_CONFIRM; UI_ShowConfirmDialog(g_confirm); }
                }
            } else if (g_screen == SCREEN_CONFIRM) {
                if ((x > CONF_BTN_OK_X1) && (x < CONF_BTN_OK_X2) && (y > CONF_BTN_OK_Y1) && (y < CONF_BTN_OK_Y2)) {
                    if (g_confirm == CONFIRM_PC_OFF) {
                        g_app.pc_on = 0; Seat_PC_Set(0);
                        g_screen = SCREEN_INUSE; g_confirm = CONFIRM_NONE;
                        UI_DrawInuseStatic(); UI_UpdateStateLine(); UI_UpdateUserLine();
                        UI_UpdateCardLine(); UI_UpdateBalanceLine(); UI_UpdateRuntimeAndFee();
                        UI_UpdatePCButton(); UI_UpdateLightButton();
                    } else if (g_confirm == CONFIRM_EXIT) App_EndSession();
                } else if ((x > CONF_BTN_CANCEL_X1) && (x < CONF_BTN_CANCEL_X2) && (y > CONF_BTN_CANCEL_Y1) && (y < CONF_BTN_CANCEL_Y2)) {
                    g_screen = SCREEN_INUSE; g_confirm = CONFIRM_NONE;
                    UI_DrawInuseStatic(); UI_UpdateStateLine(); UI_UpdateUserLine();
                    UI_UpdateCardLine(); UI_UpdateBalanceLine(); UI_UpdateRuntimeAndFee();
                    UI_UpdatePCButton(); UI_UpdateLightButton();
                }
            }
        }
    } else g_touch_down = 0;
}
